app/controllers/orders_controller.rb

  def index

if current_user
    @inivtedOrder = Order.joins(:friend_orders).where(friend_orders:{friend_id:current_user.id}).paginate(:page => params[:page], :per_page => 3)
    @orders = Order.where(user_id:current_user.id).paginate(:page => params[:page], :per_page => 3)
---
SELECT  `orders`.* FROM `orders` INNER JOIN `friend_orders` ON `friend_orders`.`order_id` = `orders`.`id` WHERE `friend_orders`.`friend_id` = 1 LIMIT 3 OFFSET 0
SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 LIMIT 3 OFFSET 0